# .oOOoO.
# |=====|_    lukejans
# |||||||_)   Brewfile
# |||||||
# `--=--'

# repo taps
tap "beeftornado/rmtree"
tap "bell-sw/liberica"
tap "danielgatis/imgcat"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/test-bot"

# cli tools
brew "arduino-cli"
brew "bat"
brew "bottom"
brew "btop"
brew "coreutils"
brew "fastfetch"
brew "sqlite"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "iftop"
brew "jenv"
brew "jq"
brew "nano"
brew "nmap"
brew "openjdk"
brew "php"
brew "poppler"
brew "qemu"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "starship"
brew "tlrc"
brew "tmux"
brew "tpm"
brew "watch"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"

# fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-zed-mono"

# apps
cask "ghostty"
cask "inkscape"
cask "karabiner-elements"
cask "liberica-jdk21-full"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "utm"
cask "zed"
cask "zen-browser"
