tap "bats-core/bats-core"
tap "beeftornado/rmtree"
tap "homebrew/command-not-found"
tap "homebrew/test-bot"
tap "rvben/rumdl"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "xo/xo"
brew "libpng"
brew "webp"
brew "openssl@3"
brew "arduino-cli"
brew "autoconf"
brew "automake"
brew "gettext"
brew "ncurses"
brew "readline"
brew "bash"
brew "bat"
brew "gmp"
brew "coreutils"
brew "bats-core"
brew "bc"
brew "bison"
brew "bottom"
brew "btop"
brew "bzip2"
brew "freetype"
brew "cmake"
brew "cmake-docs"
brew "colordiff"
brew "curl"
brew "krb5"
brew "docker"
brew "docker-compose"
brew "icu4c@77"
brew "dotnet"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "icu4c@78"
brew "libsodium"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "sqlite"
brew "git-filter-repo"
brew "glab"
brew "gnu-sed"
brew "httpd"
brew "libzip"
brew "imagemagick"
brew "inetutils"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazysql"
brew "leetgo"
brew "less"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "mhash"
brew "micro"
brew "usage"
brew "mise"
brew "zlib"
brew "mysql"
brew "nano"
brew "neovim"
brew "ollama"
brew "pcre"
brew "pkgconf"
brew "poppler"
brew "qemu"
brew "re2c"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "sqlcmd"
brew "starship"
brew "tailscale"
brew "tlrc"
brew "tmux"
brew "watch"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "bats-core/bats-core/bats-assert"
brew "bats-core/bats-core/bats-support"
brew "rvben/rumdl/rumdl"
brew "shivammathur/extensions/xdebug@7.2"
brew "shivammathur/php/php", link: false
brew "shivammathur/php/php@7.2", link: true
brew "xo/xo/usql", args: ["with-odbc"]
cask "aldente"
cask "appcleaner"
cask "capcut"
cask "crystalfetch"
cask "docker-desktop"
cask "font-bigblue-terminal-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-zed-mono"
cask "ghostty"
cask "google-chrome"
cask "intellij-idea"
cask "karabiner-elements"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "utm"
cask "visual-studio-code"
cask "zed"
mas "Equinox", id: 1591510203
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Noir", id: 1592917505
mas "OneDrive", id: 823766827
mas "uBlock Origin Lite", id: 6745342698
mas "Xcode", id: 497799835
vscode "beaglefoot.awk-ide-vscode"
vscode "cdonohue.quill-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode.wasm-wasi-core"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
