tap 'beeftornado/rmtree'
tap 'homebrew/command-not-found'
tap 'homebrew/test-bot'
brew 'openssl@3'
brew 'arduino-cli'
brew 'autoconf'
brew 'bat'
brew 'bottom'
brew 'btop'
brew 'cmake'
brew 'cmake-docs'
brew 'gmp'
brew 'coreutils'
brew 'eza'
brew 'fastfetch'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'readline'
brew 'sqlite'
brew 'git-filter-repo'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'libyaml'
brew 'mas'
brew 'usage'
brew 'mise'
brew 'nano'
brew 'ollama'
brew 'php'
brew 'poppler'
brew 'qemu'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'sponge'
brew 'starship'
brew 'tailscale'
brew 'tlrc'
brew 'tmux'
brew 'tpm'
brew 'watch'
brew 'yazi'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-fast-syntax-highlighting'
cask 'appcleaner'
cask 'chatgpt'
cask 'discord'
cask 'font-bigblue-terminal-nerd-font'
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monaspace'
cask 'font-sf-mono'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-zed-mono'
cask 'ghostty'
cask 'karabiner-elements'
cask 'raspberry-pi-imager'
cask 'utm'
cask 'zed'
cask 'zen'
mas 'Equinox', id: 1_591_510_203
mas 'Xcode', id: 497_799_835
