tap "beeftornado/rmtree"
tap "homebrew/command-not-found"
tap "homebrew/test-bot"
tap "shivammathur/php"
brew "libpng"
brew "webp"
brew "openssl@3"
brew "arduino-cli"
brew "autoconf"
brew "automake"
brew "bat"
brew "bottom"
brew "btop"
brew "bzip2"
brew "freetype"
brew "gettext"
brew "cmake"
brew "cmake-docs"
brew "gmp"
brew "coreutils"
brew "curl"
brew "krb5"
brew "docker"
brew "docker-compose"
brew "icu4c@77"
brew "dotnet"
brew "eza"
brew "fastfetch"
brew "libsodium"
brew "ffmpeg"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "readline"
brew "sqlite"
brew "git-filter-repo"
brew "imagemagick"
brew "inetutils"
brew "jpeg"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "libzip"
brew "mas"
brew "mhash"
brew "micro"
brew "usage"
brew "mise"
brew "mono"
brew "nano"
brew "ollama"
brew "pcre"
brew "poppler"
brew "qemu"
brew "re2c"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "sqlcmd"
brew "starship"
brew "tailscale"
brew "tlrc"
brew "tmux"
brew "tpm"
brew "watch"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "shivammathur/php/php", link: false
brew "shivammathur/php/php@7.2", link: true
cask "appcleaner"
cask "blackhole-2ch"
cask "discord"
cask "docker-desktop"
cask "font-bigblue-terminal-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-zed-mono"
cask "ghostty"
cask "karabiner-elements"
cask "obs"
cask "raspberry-pi-imager"
cask "utm"
cask "visual-studio-code"
cask "zed"
cask "zen"
mas "Equinox", id: 1591510203
mas "Xcode", id: 497799835
vscode "cdonohue.quill-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
